/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Hiermit debuggen Sie Ihren JavaScript-Code in Microsoft Edge.",
	"edge.toggleSkipping.title": "Microsoft Edge: Überspringen dieser Datei aktivieren/deaktivieren",
	"edge.toggleSmartStep.title": "Microsoft Edge: Smart Step aktivieren/deaktivieren",
	"edge.port.description": "Port zur Verwendung für das Microsoft Edge-Remotedebuggen.",
	"edge.address.description": "TCP/IP-Adresse des Debugports",
	"edge.file.description": "Eine lokale HTML-Datei zum Öffnen im Browser",
	"edge.url.description": "Es wird nach einer Registerkarte mit dieser exakten URL gesucht und bei Erfolg ein Anfügevorgang durchgeführt.",
	"edge.webRoot.description": "Gibt den absoluten Arbeitsbereichspfad zum Webserverstamm an. Wird zur Auflösung von Pfaden wie \"/app.js\" zu Dateien auf dem Datenträger verwendet. Kurzschreibweise für ein pathMapping für \"/\".",
	"edge.pathMapping.description": "Zuordnung der URLs/Pfade zur lokalen Ordner und zum Auflösen von Skripts in Microsoft Edge in Skripts auf dem Datenträger",
	"edge.runtimeExecutable.description": "Absoluter Arbeitsbereichspfad zur zu verwendenden ausführbaren Runtimedatei. Falls keiner angegeben wird, wird Microsoft Edge vom Standardinstallationsspeicherort aus verwendet.",
	"edge.runtimeArgs.description": "Optionale Argumente, die an die ausführbare Datei der Runtime übergeben werden.",
	"edge.env.description": "Optionales Wörterbuch mit Schlüssel-Wert-Paaren der Umgebung.",
	"edge.cwd.description": "Optionales Arbeitsverzeichnis für die ausführbare Runtimedatei.",
	"edge.sourceMaps.description": "Hiermit werden JavaScript-Quellzuordnungen verwendet (sofern vorhanden).",
	"edge.diagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter eigene Diagnoseinformationen in einem lesbaren Format in der Konsole.",
	"edge.verboseDiagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter den gesamten Datenverkehr mit Client und Ziel (sowie die über \"diagnosticLogging\" erfassten Informationen).",
	"edge.trace.description": "Bei Festlegung auf TRUE protokolliert der Debugger Ablaufverfolgungsinformationen in einer Datei. Bei Festlegung auf \"verbose\" werden auch Protokolle in der Konsole angezeigt.",
	"edge.sourceMapPathOverrides.description": "Eine Reihe von Zuordnungen zum Umschreiben der Speicherorte von Quelldateien gemäß Quellzuordnung in die Speicherorte auf dem Datenträger. Ausführliche Informationen finden Sie in der README-Datei.",
	"edge.smartStep.description": "Automatisch nicht zugeordnete Zeilen in Quellzuordnungsdateien durchlaufen, z.B. von TypeScript automatisch generierter Code beim Herunterkompilieren von async/await oder anderen Features.",
	"edge.skipFiles.description": "Ein Array aus Datei- oder Ordnernamen oder Pfadglobs, die beim Debuggen übersprungen werden sollen.",
	"edge.timeout.description": "Gibt den Zeitraum in Millisekunden an, nach dem erneut versucht wird, eine Verbindung mit Microsoft Edge herzustellen. Der Standardwert ist 10000 ms.",
	"edge.disableNetworkCache.description": "Gibt ab, ob der Netzwerkcache für jede Anfrage übersprungen werden soll",
	"edge.urlFilter.description": "Suchen Sie nach einer Seite mit dieser URL, und führen Sie eine Anfügung daran durch, wenn sie gefunden wird. Darf * als Platzhalter enthalten.",
	"edge.showAsyncStacks.description": "Hiermit werden die asynchronen Aufrufe angezeigt, die zur aktuellen Aufrufliste geführt haben",
	"edge.logTimestamps.description": "Boolescher Wert zum Deaktivieren/Aktivieren der Protokollierung von Zeitstempeln in den Protokolldateien (standardmäßig aktiviert).",
	"edge.version.description": "Gibt an, dass der Adapter Microsoft Edge (Chromium) verwenden soll. Lassen Sie dieses Flag weg, wenn Sie Microsoft Edge (EdgeHTML) verwenden möchten.",
	"edge.userDataDir.description": "Standardmäßig wird Microsoft Edge mit einem separaten Benutzerprofil in einem temporären Ordner gestartet. Verwenden Sie diese Option, um sie zu überschreiben. Legen Sie sie auf \"False\" fest, um den Browser mit Ihrem Standardbenutzerprofil zu starten. Beachten Sie, dass dies nur für Microsoft Edge (Chromium) gilt und nicht für Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Experimentelles Feature – Wenn auf \"True\" festgelegt, versucht der Debugadapter Breakpoints in Skripts einzufügen, bevor diese geladen werden, damit er diese am Anfang der Skripts erreichen kann. Wirkt sich auf die Leistung aus. Beachten Sie, dass dies nur für Microsoft Edge (Chromium) gilt und nicht für Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Die für breakOnLoad zu verwendende Strategie. Beachten Sie, dass dies nur für Microsoft Edge (Chromium) und nicht für Microsoft Edge (EdgeHTML) gilt.",
	"edge.breakOnLoadStrategy.instrument.description": "Geben Sie an, dass Microsoft Edge jeweils beim Laden eines Skripts anhalten soll, um Quellzuordnungsdateien aufzulösen und Breakpoints festzulegen",
	"edge.breakOnLoadStrategy.regex.description": "Legt Haltepunkte optimistisch in Dateien fest, die denselben Namen wie die Datei aufweisen, in der der Haltepunkt festgelegt ist.",
	"edge.breakOnLoadStrategy.off.description": "Deaktiviert BreakOnLoad.",
	"edge.targetTypes.description": "Ein Array von zulässigen Zieltypen. Der Standardwert ist \"[\"page\"]\"."
}