/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Hiermit debuggen Sie Ihren JavaScript-Codes im Microsoft Edge-Browser.",
	"edge.toggleSkipping.title": "Überspringen dieser Datei aktivieren/deaktivieren",
	"edge.port.description": "Port zur Verwendung zum Microsoft Edge-Remotedebuggen.",
	"edge.address.description": "TCP/IP-Adresse des Debugports",
	"edge.file.description": "Eine lokale HTML-Datei zum Öffnen im Browser",
	"edge.url.description": "Es wird nach einer Registerkarte mit dieser EXAKTEN URL gesucht und bei Erfolg ein Anfügevorgang durchgeführt.",
	"edge.webRoot.description": "Gibt den absoluten Arbeitsbereichspfad zum Webserverstamm an. Wird zur Auflösung von Pfaden wie \"/app.js\" zu Dateien auf dem Datenträger verwendet. Kurzschreibweise für ein pathMapping für \"/\".",
	"edge.pathMapping.description": "Eine Zuordnung von URLs/Pfaden zu lokalen Ordnern zum Auflösen von Skripts in Microsoft Edge zu Skripts auf dem Datenträger",
	"edge.runtimeExecutable.description": "Absoluter Arbeitsbereichspfad zur zu verwendenden ausführbaren Runtimedatei. Falls keiner angegeben wird, wird Microsoft Edge aus dem Installationsspeicherort verwendet.",
	"edge.runtimeArgs.description": "Optionale Argumente, die an die ausführbare Datei der Runtime übergeben werden.",
	"edge.env.description": "Optionales Wörterbuch mit Schlüssel-Wert-Paaren der Umgebung.",
	"edge.cwd.description": "Optionales Arbeitsverzeichnis für die ausführbare Runtimedatei.",
	"edge.sourceMaps.description": "Hiermit werden JavaScript-Quellzuordnungen verwendet (sofern vorhanden).",
	"edge.diagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter eigene Diagnoseinformationen in einem lesbaren Format in der Konsole.",
	"edge.verboseDiagnosticLogging.description": "Bei Festlegung auf TRUE protokolliert der Adapter den gesamten Datenverkehr mit Client und Ziel (sowie die über \"diagnosticLogging\" erfassten Informationen).",
	"edge.trace.description": "Bei Festlegung auf TRUE protokolliert der Debugger Ablaufverfolgungsinformationen in einer Datei. Bei Festlegung auf \"verbose\" werden auch Protokolle in der Konsole angezeigt.",
	"edge.sourceMapPathOverrides.description": "Eine Reihe von Zuordnungen zum Umschreiben der Speicherorte von Quelldateien gemäß Quellzuordnung in die Speicherorte auf dem Datenträger. Ausführliche Informationen finden Sie in der README-Datei.",
	"edge.skipFiles.description": "Ein Array aus Datei- oder Ordnernamen oder Pfadglobs, die beim Debuggen übersprungen werden sollen.",
	"edge.timeout.description": "Gibt den Zeitraum in Millisekunden an, nach dem erneut versucht wird, eine Verbindung mit Microsoft Edge herzustellen. Der Standardwert ist 10000 ms.",
	"edge.breakOnLoadStrategy.description": "Die für breakOnLoad zu verwendende Strategie.",
	"edge.breakOnLoadStrategy.off.description": "Deaktiviert BreakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Legt Haltepunkte in Dateien optimistisch fest, die denselben Namen aufweisen wie die Datei, in der der Haltepunkt festgelegt ist.",
	"edge.logTimestamps.description": "Boolescher Wert zum Deaktivieren/Aktivieren der Protokollierung von Zeitstempeln in den Protokolldateien (standardmäßig aktiviert)."
}