/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"edge.toggleSkipping.title": "Включить/выключить пропуск этого файла",
	"edge.address.description": "TCP/IP адрес порта отладки",
	"edge.file.description": "Локальный HTML-файл, открываемый в браузере",
	"edge.url.description": "Поиск вкладки с указанным URL-адресом и присоединение к ней, если это возможно",
	"edge.webRoot.description": "Указывает абсолютный путь рабочей области начиная с корневого каталога веб-сервера. Используется для преобразования путей вида \"/app.js\" в пути к файлам на диске. Сокращенный вариант pathMapping для \"/\"",
	"edge.pathMapping.description": "Сопоставление URL-адресов или путей с локальными папками для привязки скриптов в Edge к скриптам на диске",
	"edge.runtimeExecutable.description": "Абсолютный путь к исполняемому файлу среды выполнения в рабочей области. Если этот параметр не указан, будет использован путь к Edge из каталога установки по умолчанию.",
	"edge.runtimeArgs.description": "Необязательные аргументы, переданные исполняемому файлу среды выполнения.",
	"edge.env.description": "Дополнительный словарь пар \"ключ/значение\" для среды.",
	"edge.cwd.description": "Дополнительный рабочий каталог для исполняемого файла среды выполнения.",
	"edge.sourceMaps.description": "Использовать карты исходного кода JavaScript (если они существуют).",
	"edge.diagnosticLogging.description": "Если этот параметр имеет значение 'true', адаптер выводит свои диагностические сведения в консоль в понятном формате",
	"edge.verboseDiagnosticLogging.description": "Если этот параметр имеет значение 'true', адаптер записывает в журнал весь трафик с клиентом и целевым узлом (а также сведения, записываемые параметром 'diagnosticLogging')",
	"edge.trace.description": "Если этот параметр имеет значение 'true', отладчик будет записывать сведения о трассировке в файл. Если этот параметр имеет значение 'verbose', сведения также будут отображаться в консоли.",
	"edge.sourceMapPathOverrides.description": "Набор сопоставлений для изменения расположения исходных файлов с расположения, указанного в карте исходного кода, на расположение этих файлов на диске. Дополнительные сведения см. в файле README.",
	"edge.skipFiles.description": "Массив имен файлов, имен папок или стандартных масок, которые следует пропустить при отладке.",
	"edge.timeout.description": "Повторять в течение этого количества миллисекунд для подключения к Edge. Значение по умолчанию — 10000 мс.",
	"edge.breakOnLoadStrategy.description": "Стратегия использования breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Отключает breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Оптимистически устанавливает точки останова в файлах с теми же именами, что и файл, в котором устанавливается точка останова."
}