/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Отладка кода JavaScript в браузере Microsoft Edge.",
	"edge.toggleSkipping.title": "Microsoft Edge: переключить пропуск этого файла",
	"edge.toggleSmartStep.title": "Microsoft Edge: переключить смарт-шаг",
	"edge.port.description": "Порт, используемый для удаленной отладки Microsoft Edge.",
	"edge.address.description": "TCP/IP-адрес порта отладки",
	"edge.file.description": "Локальный HTML-файл, который будет открыт в браузере.",
	"edge.url.description": "Будет искать вкладку с точно таким же URL-адресом и подключится к ней в случае обнаружения.",
	"edge.webRoot.description": "Этот параметр указывает абсолютный путь рабочей области к корневому каталогу веб-сервера. Используется для разрешения путей к файлам на диске (например, \"/app.js\"). Сокращение для pathMapping для \"/\".",
	"edge.pathMapping.description": "Сопоставление URL-адресов или путей к локальным папкам для сопоставления скриптов в Microsoft Edge и скриптов на диске.",
	"edge.runtimeExecutable.description": "Абсолютный путь рабочей области к используемому исполняемому файлу среды выполнения. Если не указан, будет использовано расположение установки Microsoft Edge по умолчанию.",
	"edge.runtimeArgs.description": "Необязательные аргументы, исполняемому файлу среды выполнения.",
	"edge.env.description": "Дополнительный словарь пар \"ключ/значение\" среды.",
	"edge.cwd.description": "Дополнительный рабочий каталог для исполняемого файла среды выполнения.",
	"edge.sourceMaps.description": "Использовать карты исходного кода JavaScript (если они существуют).",
	"edge.diagnosticLogging.description": "Если параметр имеет значение \"true\", адаптер выводит свои диагностические сведения в консоль в понятном формате.",
	"edge.verboseDiagnosticLogging.description": "Если указано значение true, адаптер регистрирует весь трафик с клиентом и целевым объектом (а также сведения, регистрируемые \"diagnosticLogging\")",
	"edge.trace.description": "Если задано значение \"true\", отладчик заносит сведения трассировки в файл. Если задано значение \"verbose\", он также отображает журналы в консоли.",
	"edge.sourceMapPathOverrides.description": "Набор сопоставлений для переопределения расположений исходных файлов с указанных в sourcemap на реальные расположения на диске. Дополнительные сведения см. в файле сведений.",
	"edge.smartStep.description": "Автоматический пропуск несопоставленных строк в файлах сопоставителей исходного кода. Например, кода, который автоматически формирует TypeScript при обратной компиляции async/await или других функций.",
	"edge.skipFiles.description": "Массив имен файлов или папок либо стандартных масок, которые будут пропущены при отладке.",
	"edge.timeout.description": "Повтор в течение указанного количества миллисекунд для подключения к Microsoft Edge. Значение по умолчанию — 10 000 мс.",
	"edge.disableNetworkCache.description": "Определяет, нужно ли пропускать кэш сети для каждого запроса.",
	"edge.urlFilter.description": "Будет искать страницу с этим URL-адресом и подключится к ней, если она найдена. Можно использовать подстановочные знаки *.",
	"edge.showAsyncStacks.description": "Отображение асинхронных вызовов, которые привели к текущему стеку вызовов",
	"edge.logTimestamps.description": "Логическое значение, определяющее, следует ли включить указание меток времени в файлах журналов (по умолчанию включено).",
	"edge.version.description": "Сообщает адаптеру, что необходимо использовать браузер Microsoft Edge (Chromium). Если вы хотите использовать браузер Microsoft Edge (EdgeHTML), опустите этот флаг.",
	"edge.userDataDir.description": "По умолчанию Microsoft Edge запускается с отдельным профилем пользователя в папке temp. Используйте этот параметр, чтобы переопределить это поведение. Установите значение \"false\", чтобы запускать браузер с профилем пользователя по умолчанию. Обратите внимание, что это применяется только к браузеру Microsoft Edge (Chromium) и не будет работать в браузере Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Экспериментальная функция — если установлено значение \"true\", то адаптер отладки попытается установить точки останова в сценариях перед их загрузкой, чтобы обеспечить срабатывание точек останова в начале этих скриптов. Эта функция оказывает влияние на производительность. Обратите внимание, что это применяется только к Microsoft Edge (Chromium) и не применяется к Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Стратегия, используемая для breakOnLoad. Обратите внимание, что это применяется только к Microsoft Edge (Chromium) и не применяется к Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Сообщает Microsoft Edge о том, что необходимо приостановить работу после загрузки каждого скрипта для разрешения сопоставителей с исходным кодом и установки точек останова.",
	"edge.breakOnLoadStrategy.regex.description": "Оптимистично устанавливает точки останова в файлах с таким же именем, как у файла, в котором установлена точка останова.",
	"edge.breakOnLoadStrategy.off.description": "Отключает breakOnLoad.",
	"edge.targetTypes.description": "Массив допустимых типов целевых объектов. Значение по умолчанию — '[\"page\"]'."
}