/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Отладка кода JavaScript в браузере Microsoft Edge",
	"edge.toggleSkipping.title": "Переключение пропуска этого файла",
	"edge.port.description": "Порт, используемый для удаленной отладки Microsoft Edge.",
	"edge.address.description": "Адрес TCP/IP порта отладки",
	"edge.file.description": "Локальный HTML-файл, который нужно открыть в браузере",
	"edge.url.description": "Будет выполняться поиск вкладки с этим точным URL-адресом и переход по нему, если адрес будет найден.",
	"edge.webRoot.description": "Разрешает абсолютный путь рабочей области к корневому каталогу веб-сервера. Используется для разрешения путей, таких как \"/app.js\" к файлам на диске. Сокращение для pathMapping для \"/\".",
	"edge.pathMapping.description": "Сопоставление URL-адресов или путей к локальным папкам для разрешения скриптов в Microsoft Edge со скриптами на диске.",
	"edge.runtimeExecutable.description": "Абсолютный путь рабочей области к используемому исполняемому файлу среды выполнения. Если путь не указан, Microsoft Edge будет использоваться из папки установки по умолчанию.",
	"edge.runtimeArgs.description": "Необязательные аргументы, исполняемому файлу среды выполнения.",
	"edge.env.description": "Дополнительный словарь пар \"ключ/значение\" среды.",
	"edge.cwd.description": "Дополнительный рабочий каталог для исполняемого файла среды выполнения.",
	"edge.sourceMaps.description": "Использовать карты исходного кода JavaScript (если они существуют).",
	"edge.diagnosticLogging.description": "Если задано значение TRUE, адаптер выводит свои диагностические сведения в консоль в понятном для человека формате.",
	"edge.verboseDiagnosticLogging.description": "Если указано значение true, адаптер регистрирует весь трафик с клиентом и целевым объектом (а также сведения, регистрируемые \"diagnosticLogging\")",
	"edge.trace.description": "Если задано значение \"true\", отладчик заносит сведения трассировки в файл. Если задано значение \"verbose\", он также отображает журналы в консоли.",
	"edge.sourceMapPathOverrides.description": "Набор сопоставлений для переопределения расположений исходных файлов с указанных в sourcemap на реальные расположения на диске. Дополнительные сведения см. в файле сведений.",
	"edge.skipFiles.description": "Массив имен файлов или папок либо стандартных масок для пропуска при отладке.",
	"edge.timeout.description": "Повторять в течение этого количества миллисекунд для подключения к Microsoft Edge. Значение по умолчанию — 10 000 мс.",
	"edge.breakOnLoadStrategy.description": "Стратегия, используемая для breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Отключает breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Устанавливает точки останова оптимистически в файлах с тем же именем, что и у файла, в котором задана точка останова.",
	"edge.logTimestamps.description": "Логическое значение, включающее или выключающее регистрацию меток времени в файлах журналов (включено по умолчанию)."
}