/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"edge.toggleSkipping.title": "Attiva/disattiva \"Ignora questo file\"",
	"edge.url.description": "Cerca una scheda con l'esatto url e la allega ad esso, se trovato",
	"edge.webRoot.description": "Specifica il percorso assoluto dell'area di lavoro nella root del webserver. Utilizzato per risolvere i percorsi come `/app.js` al file su disco. Forma abbreviata di un pathMapping per \"/\"",
	"edge.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
	"edge.cwd.description": "Directory di lavoro facoltativa per l'eseguibile di runtime.",
	"edge.sourceMaps.description": "Usa i mapping di origine JavaScript (se esistenti).",
	"edge.diagnosticLogging.description": "Se impostato a true, l'adapter registra le proprie informazioni di diagnostica sulla console in un formato leggibile",
	"edge.verboseDiagnosticLogging.description": "Quando è true, l'adapter registra tutto il traffico con il client e con il target (oltre alle informazioni registrate dal 'diagnosticLogging')",
	"edge.trace.description": "Se 'true', il debugger registrerà informazioni di trace in un file. Se 'verbose', mostrerà anche i log nella console.",
	"edge.sourceMapPathOverrides.description": "Un insieme di mapping per riscrivere i percorsi dei file sorgenti dalla locazione indicata nel sourcemap alla loro posizione sul disco. Per dettagli, vedere il file README.",
	"edge.smartStep.description": "Esegue automaticamente un'istruzione alla volta del codice generato che non può essere mappato all'origine.",
	"edge.skipFiles.description": "Una matrice di nomi di file, nomi di cartelle, o modelli di glob, da ignorare durante il debug.",
	"edge.urlFilter.description": "Cerca una pagina con questo url e lo allega ad essa, se trovato. Può avere caratteri jolly \"*\".",
	"edge.showAsyncStacks.description": "Visualizza le chiamate asincrone che hanno portato allo stack di chiamate corrente",
	"edge.breakOnLoadStrategy.description": "Strategia da utilizzare per breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Imposta i breakpoint ottimisticamente nei file con lo stesso nome dei file in cui i breakpoint sono già definiti."
}