{
	"extension.description": "Debuguj swój kod JavaScript w przeglądarce Microsoft Edge",
	"edge.toggleSkipping.title": "Microsoft Edge: przełącz pomijanie tego pliku",
	"edge.toggleSmartStep.title": "Microsoft Edge: przełącz krok inteligentny",
	"edge.port.description": "Port, który ma być używany do zdalnego debugowania w przeglądarce Microsoft Edge.",
	"edge.address.description": "Adres TCP/IP portu debugowania",
	"edge.file.description": "Lokalny plik html do otworzenia w przeglądarce",
	"edge.url.description": "Wyszuka kartę z DOKŁADNIE takim adresem URL i podłączy się do niej, jeśli zostanie znaleziona",
	"edge.webRoot.description": "Określa ścieżkę bezwzględną obszaru roboczego do katalogu głównego serwera internetowego. Służy do znajdowania plików na dysku dla ścieżek takich jak „/app.js”. Skrócona forma opcji pathMapping dla „/”",
	"edge.pathMapping.description": "Mapowanie adresów URL/ścieżek na foldery lokalne na potrzeby rozpoznawania skryptów w przeglądarce Microsoft Edge jako skryptów na dysku",
	"edge.runtimeExecutable.description": "Ścieżka bezwzględna obszaru roboczego do pliku wykonywalnego środowiska uruchomieniowego, który ma być używany. Jeśli nie zostanie określona, będzie używana przeglądarka Microsoft Edge z domyślnej lokalizacji instalacji.",
	"edge.runtimeArgs.description": "Argumenty opcjonalne przekazywane do pliku wykonywalnego środowiska uruchomieniowego.",
	"edge.env.description": "Opcjonalny słownik dla par klucz/wartość środowiska.",
	"edge.cwd.description": "Opcjonalny katalog roboczy dla pliku wykonywalnego środowiska uruchomieniowego.",
	"edge.sourceMaps.description": "Użyj mapy źródła JavaScript (jeśli istnieją).",
	"edge.diagnosticLogging.description": "Gdy ma wartość true, karta rejestruje swoje własne informacje diagnostyczne w konsoli w postaci czytelnej dla użytkownika",
	"edge.verboseDiagnosticLogging.description": "Gdy ma wartość true, adapter rejestruje cały ruch z klientem i elementem docelowym (jak również informacje rejestrowane przez funkcję „diagnosticLogging”)",
	"edge.trace.description": "W przypadku ustawienia „true” debuger będzie rejestrował informacje o śledzeniu w pliku. W przypadku ustawienia „verbose” wyświetli również dzienniki w konsoli.",
	"edge.sourceMapPathOverrides.description": "Zestaw mapowań na potrzeby przepisania lokalizacji plików źródłowych z lokalizacji określonych przez mapę źródła do ich lokalizacji na dysku. Aby uzyskać szczegółowe informacje, zobacz plik README.",
	"edge.smartStep.description": "Automatycznie przechodź przez niezamapowane wiersze w plikach typu sourcemapped. Na przykład kod, który język TypeScript tworzy automatycznie w przypadku kompilowania składni async/await lub innych funkcji do niższego poziomu.",
	"edge.skipFiles.description": "Tablica nazw plików lub folderów albo wzorców globalnych ścieżek do pomijania podczas debugowania.",
	"edge.timeout.description": "Ponawiaj próbę połączenia z przeglądarką Microsoft Edge przez tę liczbę milisekund. Wartość domyślna to 10 000 ms.",
	"edge.disableNetworkCache.description": "Określa, czy pamięć podręczna sieci ma być pomijana dla każdego żądania",
	"edge.urlFilter.description": "Wyszuka kartę z tym adresem URL i dołączy do niej, jeśli zostanie znaleziona. Może zawierać symbole wieloznaczne *.",
	"edge.showAsyncStacks.description": "Pokaż wywołania asynchroniczne, które doprowadziły do bieżącego stosu wywołań",
	"edge.logTimestamps.description": "Wartość logiczna do wyłączania/włączania rejestrowania sygnatur czasowych w plikach dziennika (domyślnie włączone).",
	"edge.version.description": "Informuje adapter o konieczności użycia przeglądarki Microsoft Edge (Chromium). Pomiń tę flagę, jeśli chcesz uruchamiać przy użyciu przeglądarki Microsoft Edge (EdgeHTML).",
	"edge.userDataDir.description": "Domyślnie przeglądarka Microsoft Edge jest uruchamiana z osobnego profilu użytkownika w folderze tymczasowym. Użyj tej opcji, aby przesłonić to ustawienie. Ustaw wartość false, aby uruchamianie odbywało się przy użyciu domyślnego profilu użytkownika. Pamiętaj, że ma to zastosowanie wyłącznie w przeglądarce Microsoft Edge (Chromium) i nie będzie działać w przeglądarce Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Funkcja eksperymentalna — w przypadku wartości true adapter debugowania podejmie próbę ustawienia punktów przerwania w skryptach przed ich załadowaniem, tak aby punkty przerwania były trafiane na początku tych skryptów. Ma to wpływ na wydajność. Pamiętaj, że ma to zastosowanie wyłącznie w przeglądarce Microsoft Edge (Chromium) i nie będzie działać w przeglądarce Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Strategia do użycia w przypadku ustawienia breakOnLoad. Pamiętaj, że ma ona zastosowanie wyłącznie w przeglądarce Microsoft Edge (Chromium) i nie będzie działać w przeglądarce Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Poinformuj przeglądarkę Microsoft Edge, że ma wstrzymywać działanie podczas ładowania poszczególnych skryptów w celu rozpoznania map źródłowych i ustawienia punktów przerwania",
	"edge.breakOnLoadStrategy.regex.description": "Optymistycznie ustawia punkty przerwania w plikach o takiej samej nazwie co plik, w którym punkt przerwania jest ustawiony.",
	"edge.breakOnLoadStrategy.off.description": "Wyłącza ustawienie breakOnLoad.",
	"edge.targetTypes.description": "Tablica dozwolonych typów docelowych. Wartość domyślna to „[\"page\"]”."
}