{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Включить/выключить пропуск этого файла",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "TCP/IP адрес порта отладки",
	"edge.file.description": "Локальный HTML-файл, открываемый в браузере",
	"edge.url.description": "Поиск вкладки с указанным URL-адресом и присоединение к ней, если это возможно",
	"edge.webRoot.description": "Указывает абсолютный путь рабочей области начиная с корневого каталога веб-сервера. Используется для преобразования путей вида \"/app.js\" в пути к файлам на диске. Сокращенный вариант pathMapping для \"/\"",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Необязательные аргументы, переданные исполняемому файлу среды выполнения.",
	"edge.env.description": "Дополнительный словарь пар \"ключ/значение\" для среды.",
	"edge.cwd.description": "Дополнительный рабочий каталог для исполняемого файла среды выполнения.",
	"edge.sourceMaps.description": "Использовать карты исходного кода JavaScript (если они существуют).",
	"edge.diagnosticLogging.description": "Если этот параметр имеет значение 'true', адаптер выводит свои диагностические сведения в консоль в понятном формате",
	"edge.verboseDiagnosticLogging.description": "Если этот параметр имеет значение 'true', адаптер записывает в журнал весь трафик с клиентом и целевым узлом (а также сведения, записываемые параметром 'diagnosticLogging')",
	"edge.trace.description": "Если этот параметр имеет значение 'true', отладчик будет записывать сведения о трассировке в файл. Если этот параметр имеет значение 'verbose', сведения также будут отображаться в консоли.",
	"edge.sourceMapPathOverrides.description": "Набор сопоставлений для изменения расположения исходных файлов с расположения, указанного в карте исходного кода, на расположение этих файлов на диске. Дополнительные сведения см. в файле README.",
	"edge.skipFiles.description": "Массив имен файлов, имен папок или стандартных масок, которые следует пропустить при отладке.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "Стратегия использования breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Оптимистически устанавливает точки останова в файлах с теми же именами, что и файл, в котором устанавливается точка останова."
}