{
	"extension.description": "Consente di eseguire il debug del codice JavaScript nel browser Microsoft Edge",
	"edge.toggleSkipping.title": "Microsoft Edge: Attiva/disattiva Ignora questo file",
	"edge.toggleSmartStep.title": "Microsoft Edge: Attiva/disattiva passaggio intelligente",
	"edge.port.description": "Porta da usare per il debug remoto in Microsoft Edge.",
	"edge.address.description": "Indirizzo TCP/IP della porta di debug",
	"edge.file.description": "File HTML locale da aprire nel browser",
	"edge.url.description": "Cerca una scheda con l'URL esatto e la collega ad esso se viene trovata",
	"edge.webRoot.description": "Specifica il percorso assoluto dell'area di lavoro nella radice di webserver. Viene usato per risolvere percorsi come `/app.js` in file su disco. Forma abbreviata di pathMapping per \"/\"",
	"edge.pathMapping.description": "Mapping di URL/percorsi di cartelle locali per risolvere gli script in Microsoft Edge in script su disco",
	"edge.runtimeExecutable.description": "Percorso assoluto dell'area di lavoro dell'eseguibile del runtime da usare. Se non è specificato, Edge verrà usato dal percorso di installazione predefinito.",
	"edge.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
	"edge.env.description": "Dizionario facoltativo di coppie chiave/valore di ambiente.",
	"edge.cwd.description": "Directory di lavoro facoltativa per l'eseguibile di runtime.",
	"edge.sourceMaps.description": "Usa i mapping di origine JavaScript (se esistenti).",
	"edge.diagnosticLogging.description": "Quando è true, l'adattatore registra le informazioni di diagnostica nella console in un formato leggibile",
	"edge.verboseDiagnosticLogging.description": "Quando è true, l'adattatore registra tutto il traffico con il client e la destinazione (oltre alle informazioni registrate da 'diagnosticLogging')",
	"edge.trace.description": "Se è 'true', il debugger registrerà informazioni di analisi in un file. Se è 'verbose', mostrerà anche i log nella console.",
	"edge.sourceMapPathOverrides.description": "Set di mapping per riscrivere i percorsi dei file di origine dalle posizioni indicate nel sourcemap alle relative posizioni sul disco. Per dettagli, vedere il file README.",
	"edge.smartStep.description": "Esegue automaticamente un'istruzione alla volta delle righe non sottoposte a mapping nei file di sourcemap, ad esempio il codice che TypeScript produce automaticamente durante la compilazione di async/await o altre funzionalità per versioni precedenti.",
	"edge.skipFiles.description": "Matrice di nomi di file o di cartelle o GLOB di percorso da ignorare durante il debug.",
	"edge.timeout.description": "Numero di millisecondi in cui vengono effettuati i tentativi di connessione a Microsoft Edge. Il valore predefinito è 10000 ms.",
	"edge.disableNetworkCache.description": "Controlla se ignorare la cache di rete per ogni richiesta",
	"edge.urlFilter.description": "Cerca una pagina con questo URL e la collega ad esso se viene trovata. Può contenere caratteri jolly (*).",
	"edge.showAsyncStacks.description": "Mostra le chiamate asincrone che hanno causato lo stack di chiamate corrente",
	"edge.logTimestamps.description": "Valore booleano per disattivare/attivare la registrazione dei timestamp nei file di log (attivato per impostazione predefinita).",
	"edge.version.description": "Indica all'adattatore di usare il browser Microsoft Edge (Chromium). Omettere questo flag per eseguire l'avvio con Microsoft Edge (EdgeHTML).",
	"edge.userDataDir.description": "Per impostazione predefinita, Microsoft Edge viene avviato con un profilo utente separato in una cartella temporanea. Usare questa opzione per eseguirne l'override. Impostare su false per avviare con il profilo utente predefinito. Tenere presente che è applicabile solo a Microsoft Edge (Chromium) e non funzionerà con Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Funzionalità sperimentale. Se è impostata su true, l'adattatore di debug proverà a impostare i punti di interruzione negli script prima che vengano caricati, in modo che i punti di interruzione vengano raggiunti all'inizio di tali script. Influisce sulle prestazioni. Tenere presente che è applicabile solo a Microsoft Edge (Chromium) e non funzionerà con Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Strategia da usare per breakOnLoad. Tenere presente che è applicabile solo a Microsoft Edge (Chromium) e non funzionerà con Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Indica a Microsoft Edge di effettuare una sospensione durante il caricamento dei singoli script, risolvendo ii sourcemap e impostando i punti di interruzione",
	"edge.breakOnLoadStrategy.regex.description": "Imposta i punti di interruzione in modalità ottimistica nei file con lo stesso nome del file in cui è impostato il punto di interruzione.",
	"edge.breakOnLoadStrategy.off.description": "Disattiva breakOnLoad.",
	"edge.targetTypes.description": "Matrice di tipi di destinazione accettabili. L'impostazione predefinita è `[\"page\"]`.",
	"edge.useWebView.description": "When 'true', the debugger will treat the runtime executable as a host application that contains a WebView allowing you to debug the WebView script content. When set to 'advanced', the debugger will wait to connect to a WebView matching the urlFilter."
}