{
	"extension.description": "Ladění kódu JavaScriptu v prohlížeči Microsoft Edge",
	"edge.toggleSkipping.title": "Microsoft Edge: Přepnout možnost přeskočení tohoto souboru",
	"edge.toggleSmartStep.title": "Microsoft Edge: Přepnout inteligentní krok",
	"edge.port.description": "Port, který se má použít pro vzdálené ladění Microsoft Edge",
	"edge.address.description": "Adresa TCP/IP portu pro ladění",
	"edge.file.description": "Místní soubor HTML, který se má otevřít v prohlížeči",
	"edge.url.description": "Bude hledat kartu s touto přesnou adresou URL, a pokud ji najde, připojí se k ní.",
	"edge.webRoot.description": "Určuje absolutní cestu pracovního prostoru ke kořenovému adresáři webového serveru. Používá se pro překlad cest k souborům na disku, například /app.js. Zkratka pro pathMapping pro /",
	"edge.pathMapping.description": "Mapování adres URL nebo cest na místní složky, aby se mohl provést překlad skriptů v Microsoft Edgi na skripty na disku",
	"edge.runtimeExecutable.description": "Absolutní cesta pracovního prostoru ke spustitelnému souboru modulu runtime, který se má použít. Pokud není zadána, použije se Edge z výchozího umístění instalace.",
	"edge.runtimeArgs.description": "Nepovinné argumenty se předaly do spustitelného souboru modulu runtime.",
	"edge.env.description": "Volitelný slovník párů klíč-hodnota prostředí",
	"edge.cwd.description": "Volitelný pracovní adresář pro spustitelný soubor modulu runtime",
	"edge.sourceMaps.description": "Použijí se mapování zdrojů JavaScriptu (pokud existují).",
	"edge.diagnosticLogging.description": "V případě hodnoty true adaptér zaznamená do konzoly svoje vlastní diagnostické informace ve formátu čitelném člověkem.",
	"edge.verboseDiagnosticLogging.description": "V případě hodnoty true adaptér zaznamenává všechny přenosy s klientem a cílem (a také informace zaznamenané prostřednictvím atributu diagnosticLogging).",
	"edge.trace.description": "V případě hodnoty true bude ladicí program zaznamenávat informace o trasování do souboru. V případě hodnoty verbose se budou protokoly zobrazovat také v konzole.",
	"edge.sourceMapPathOverrides.description": "Sada mapování pro přepsání umístění zdrojových souborů z umístění podle zdrojového mapování na jejich umístění na disku. Podrobnosti najdete v souboru README.",
	"edge.smartStep.description": "Automatické krokování pro nenamapované řádky v souborech zdrojového mapování. Například kód, který TypeScript vytváří automaticky při kompilaci async/await nebo jiných funkcí.",
	"edge.skipFiles.description": "Pole s názvy souborů či složek nebo globy cesty, které se mají při ladění přeskočit",
	"edge.timeout.description": "Opakované pokusy o připojení k Microsoft Edgi se budou provádět tento počet milisekund. Výchozí hodnota je 10000 ms.",
	"edge.disableNetworkCache.description": "Určuje, jestli se má u každého požadavku přeskočit mezipaměť sítě.",
	"edge.urlFilter.description": "Bude hledat stránku s touto adresou URL, a pokud ji najde, připojí se k ní. Může obsahovat zástupné znaky *.",
	"edge.showAsyncStacks.description": "Zobrazí se asynchronní volání, která vedla k aktuálnímu zásobníku volání.",
	"edge.logTimestamps.description": "Logická hodnota, která určuje vypnutí nebo zapnutí protokolování časových razítek v souborech protokolu (ve výchozím nastavení zapnuto)",
	"edge.version.description": "Určuje, že má adaptér používat prohlížeč Microsoft Edge (Chromium). Pokud chcete spouštět s Microsoft Edgem (EdgeHTML), vynechejte tento příznak.",
	"edge.userDataDir.description": "Microsoft Edge se ve výchozím nastavení spouští se samostatným uživatelským profilem v dočasné složce. Pomocí této možnosti lze toto nastavení přepsat. Po nastavení na hodnotu false se aplikace bude spouštět s výchozím uživatelským profilem. Upozorňujeme, že tuto funkci lze použít jenom pro Microsoft Edge (Chromium), nebude tedy fungovat s Microsoft Edgem (EdgeHTML).",
	"edge.breakOnLoad.description": "Experimentální funkce – V případě hodnoty true se adaptér ladění pokusí nastavit zarážky ve skriptech před jejich načtením, aby při spuštění těchto skriptů mohl na tyto zarážky narazit. Tato funkce má vliv na výkon. Upozorňujeme, že tuto funkci lze použít jenom pro Microsoft Edge (Chromium), nebude tedy fungovat s Microsoft Edgem (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Strategie, která se má použít pro funkci breakOnLoad. Upozorňujeme, že tuto funkci lze použít jenom pro Microsoft Edge (Chromium), nebude tedy fungovat s Microsoft Edgem (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Nastaví pozastavení Microsoft Edge při načítání každého skriptu za účelem překladu zdrojového mapování a nastavení zarážek.",
	"edge.breakOnLoadStrategy.regex.description": "Nastaví zarážky optimisticky do souborů se stejným názvem, jaký má soubor, ve kterém je zarážka nastavena.",
	"edge.breakOnLoadStrategy.off.description": "Vypne funkci breakOnLoad.",
	"edge.targetTypes.description": "Pole obsahující přípustné typy cílů. Výchozí nastavení je [\"page\"]."
}