{
	"extension.description": "Microsoft Edge tarayıcısında JavaScript kodunuzda hata ayıklama",
	"edge.toggleSkipping.title": "Microsoft Edge: Bu Dosyayı Atlamayı Aç/Kapat",
	"edge.toggleSmartStep.title": "Microsoft Edge: Akıllı Adımı Aç/Kapat",
	"edge.port.description": "Microsoft Edge uzaktan hata ayıklama için kullanılacak bağlantı noktası.",
	"edge.address.description": "Hata ayıklama bağlantı noktasının TCP/IP adresi",
	"edge.file.description": "Tarayıcıda açmak için bir yerel html dosyası",
	"edge.url.description": "Tam olarak bu URL'yi içeren bir sekme arar ve bulunursa sekmeye ekler",
	"edge.webRoot.description": "Bu, web sunucusu kökü için çalışma alanı mutlak yolunu belirtir. `/app.js` gibi yolları diskte dosyalara çözümlemek için kullanılır. \"/\" için pathMapping öğesine yönelik kısaltma",
	"edge.pathMapping.description": "Microsoft Edge'deki betikleri diskteki betiklere çözümlemek için URL'lerin/yolların yerel klasörlere eşlemesi",
	"edge.runtimeExecutable.description": "Kullanılacak çalışma zamanı yürütülebilir dosyasının çalışma alanı mutlak yolu. Belirtilmezse, varsayılan yükleme konumundan Edge kullanılır.",
	"edge.runtimeArgs.description": "Çalışma zamanı yürütülebilir dosyasına geçirilen isteğe bağlı bağımsız değişkenler.",
	"edge.env.description": "İsteğe bağlı ortam anahtar/değer çifti sözlüğü.",
	"edge.cwd.description": "Çalışma zamanı yürütülebilir dosyası için isteğe bağlı çalışma dizini.",
	"edge.sourceMaps.description": "(Varsa) JavaScript kaynak eşlemelerini kullanın.",
	"edge.diagnosticLogging.description": "Değer true olduğunda, bağdaştırıcı kendi tanılama bilgilerini insanlar tarafından okunabilir bir biçimde konsola kaydeder",
	"edge.verboseDiagnosticLogging.description": "Değer true olduğunda bağdaştırıcı, istemci ve hedefin tüm trafiğini (ve ayrıca 'diagnosticLogging' tarafından günlüğe kaydedilen bilgileri) günlüğe kaydeder",
	"edge.trace.description": "Değer 'true' olduğunda hata ayıklayıcısı, izleme bilgilerini bir dosyaya kaydeder. 'verbose' olduğunda ayrıca günlükleri konsolda gösterir.",
	"edge.sourceMapPathOverrides.description": "Kaynak dosyalarının konumlarını yeniden yazmak için, kaynak eşlemesinde belirtilen konumlardan dosyaların diskteki konumlarına yönelik bir dizi eşleme. Ayrıntılı bilgi için BENİOKU dosyasına bakın.",
	"edge.smartStep.description": "Kaynak eşlemesi yapılmış dosyalardaki eşlenmemiş satırları otomatik olarak adımlar. Örneğin, async/await veya diğer özellikleri aşağı derlerken TypeScript'in otomatik olarak ürettiği kod.",
	"edge.skipFiles.description": "Hata ayıklama sırasında atlanacak dosya veya klasör adları dizisi ya da yol globları.",
	"edge.timeout.description": "Milisaniye cinsinden, Microsoft Edge'e bağlanmanın yeniden deneneceği süre. Varsayılan: 10.000 ms.",
	"edge.disableNetworkCache.description": "Her istek için ağ önbelleğinin atlanıp atlanmayacağını denetler",
	"edge.urlFilter.description": "Bu URL'yi içeren bir sayfa arar ve bulunursa sayfaya ekler. * joker karakterler içerebilir.",
	"edge.showAsyncStacks.description": "Geçerli çağrı yığınına yol açan zaman uyumsuz çağrıları göster",
	"edge.logTimestamps.description": "Günlük dosyalarında zaman damgalarını günlüğe kaydetmeyi açmak/kapamak için Boole değeri (varsayılan olarak açık).",
	"edge.version.description": "Bağdaştırıcıya Microsoft Edge (Chromium) tarayıcı kullanmasını bildirir. Microsoft Edge (EdgeHTML) ile başlatmak istiyorsanız bu bayrağı atlayın.",
	"edge.userDataDir.description": "Varsayılan olarak, Microsoft Edge geçici bir klasörde ayrı bir kullanıcı profili ile başlatılır. Geçersiz kılmak için bu seçeneği kullanın. Varsayılan kullanıcı profiliniz ile başlatmak için false olarak ayarlayın. Bunun yalnızca Microsoft Edge (Chromium) için geçerli olduğunu ve Microsoft Edge (EdgeHTML) ile çalışmayacağını unutmayın.",
	"edge.breakOnLoad.description": "Deneysel özellik. True ise, hata ayıklama bağdaştırıcısı bu betikler yüklenmeden önce betiklerde kesme noktaları ayarlamaya çalışacak. Böylece hata ayıklama bağdaştırıcısı bu betiklerin başlangıcındaki kesme noktalarına ulaşabilir. Bu işlem performans üzerinde etkilidir. Bunun yalnızca Microsoft Edge (Chromium) için geçerli olduğunu ve Microsoft Edge (EdgeHTML) ile çalışmayacağını unutmayın.",
	"edge.breakOnLoadStrategy.description": "BreakOnLoad için kullanılacak strateji. Bunun yalnızca Microsoft Edge (Chromium) için geçerli olduğunu ve Microsoft Edge (EdgeHTML) ile çalışmayacağını unutmayın.",
	"edge.breakOnLoadStrategy.instrument.description": "Microsoft Edge'e her betik yüklenirken duraklatılmasını ve kaynak eşlemelerinin çözümlenerek kesme noktalarının ayarlanmasını söyleyin",
	"edge.breakOnLoadStrategy.regex.description": "Kesme noktasının ayarlandığı dosya ile aynı ada sahip dosyalarda kesme noktalarını iyimser bir şekilde ayarlar.",
	"edge.breakOnLoadStrategy.off.description": "breakOnLoad öğesini kapatır.",
	"edge.targetTypes.description": "Kabul edilebilir hedef türleri dizisi. `[\"page\"]` varsayılandır."
}