{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Microsoft Edge: Toggle Skipping This File",
	"edge.toggleSmartStep.title": "Microsoft Edge: Toggle Smart Step",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "TCP/IP address of debug port",
	"edge.file.description": "A local html file to open in the browser",
	"edge.url.description": "Will search for a tab with this EXACT url and attach to it, if found",
	"edge.webRoot.description": "This specifies the workspace absolute path to the webserver root. Used to resolve paths like `/app.js` to files on disk. Shorthand for a pathMapping for \"/\"",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in Microsoft Edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, Edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Optional arguments passed to the runtime executable.",
	"edge.env.description": "Optional dictionary of environment key/value pairs.",
	"edge.cwd.description": "Optional working directory for the runtime executable.",
	"edge.sourceMaps.description": "Use JavaScript source maps (if they exist).",
	"edge.diagnosticLogging.description": "When true, the adapter logs its own diagnostic info to the console in a human readable format",
	"edge.verboseDiagnosticLogging.description": "When true, the adapter logs all traffic with the client and target (as well as the info logged by 'diagnosticLogging')",
	"edge.trace.description": "When 'true', the debugger will log tracing info to a file. When 'verbose', it will also show logs in the console.",
	"edge.sourceMapPathOverrides.description": "A set of mappings for rewriting the locations of source files from what the sourcemap says, to their locations on disk. See README for details.",
	"edge.smartStep.description": "Automatically step through unmapped lines in sourcemapped files. For example, code that TypeScript produces automatically when downcompiling async/await or other features.",
	"edge.skipFiles.description": "An array of file or folder names, or path globs, to skip when debugging.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Microsoft Edge. Default is 10000 ms.",
	"edge.disableNetworkCache.description": "Controls whether to skip the network cache for each request",
	"edge.urlFilter.description": "Will search for a page with this url and attach to it, if found. Can have * wildcards.",
	"edge.showAsyncStacks.description": "Show the async calls that led to the current call stack",
	"edge.logTimestamps.description": "Boolean value to turn off/on logging of timestamps in the logfiles (turned on by default).",
	"edge.version.description": "Tells the adapter to use the Microsoft Edge (Chromium) browser. Omit this flag if wanting to launch with Microsoft Edge (EdgeHTML).",
	"edge.userDataDir.description": "By default, Microsoft Edge is launched with a separate user profile in a temp folder. Use this option to override it. Set to false to launch with your default user profile. Note that this is only applicable to Microsoft Edge (Chromium) and will not work with Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Experimental feature -  If true, the debug adapter will attempt to set breakpoints in scripts before they are loaded, so it can hit breakpoints at the beginnings of those scripts. Has a perf impact. Note that this is only applicable to Microsoft Edge (Chromium) and will not work with Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "The strategy to use for breakOnLoad. Note that this is only applicable to Microsoft Edge (Chromium) and will not work with Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Tell Microsoft Edge to pause as each script is loaded, resolving sourcemaps and setting breakpoints",
	"edge.breakOnLoadStrategy.regex.description": "Sets breakpoints optimistically in files with the same name as the file in which the breakpoint is set.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.targetTypes.description": "An array of acceptable target types. The default is `[\"page\"]`."
}