{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Activer/désactiver l'évitement de ce fichier",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "TCP/IP address of debug port",
	"edge.file.description": "Un fichier html local à ouvrir dans le navigateur",
	"edge.url.description": "Recherchera un onglet avec cette url exacte et l'attachera, s'il est trouvé",
	"edge.webRoot.description": "Ceci spécifie le chemin absolu de l’espace de travail à la racine du serveur Web. Utilisé pour résoudre des chemins d’accès comme '/app.js' à des fichiers sur le disque. Raccourci pour un pathMapping pour \"/\"",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
	"edge.env.description": "Dictionnaire optionnel de paires clé/valeur d’environnement.",
	"edge.cwd.description": "Répertoire de travail optionnel pour le runtime exécutable.",
	"edge.sourceMaps.description": "Utilisez des mappages de sources JavaScript (s'ils existent)",
	"edge.diagnosticLogging.description": "Si vrai, l’adaptateur journalise sa propre information sur le diagnostic vers la console dans un format lisible par l’homme",
	"edge.verboseDiagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise tout le trafic avec le client et la cible (ainsi que les informations journalisées par 'diagnosticLogging')",
	"edge.trace.description": "Quand la valeur est 'true', le débogueur journalise les informations de suivi dans un fichier. Quand la valeur est 'verbose', il affiche également les journaux dans la console.",
	"edge.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des informations du mappage de source vers leurs emplacements sur le disque. Consultez le fichier README pour plus de détails.",
	"edge.skipFiles.description": "Un tableau de noms de fichier ou de dossier, ou de chemin d’accès globs, à ignorer lors du débogage.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "La stratégie à utiliser pour breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Affecte les points d'arrêts de manière optimiste dans les fichiers avec le même nom que le fichier dans lequel le point d'arrêt est affecté."
}