{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Bu Dosyayı Atlamayı Aç/Kapa",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "Hata ayıklama portunun TCP/IP adresi",
	"edge.file.description": "Tarayıcıda açılacak yerel bir html dosyası",
	"edge.url.description": "Bu url'in TAMAMEN AYNISININ bulunduğu bir sayfa arayacak ve bulunduysa ona bağlayacaktır.",
	"edge.webRoot.description": "Bu, web sunucusu kök dizini için çalışma alanı mutlak yolunu belirtir. `/app.js` gibi yolların diskteki dosyalara çözümlenmesinde kullanılır. \"/\" için bir 'pathMapping' kısaltmasıdır",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Çalışma zamanı yürütülebilir dosyasına iletilecek isteğe bağlı argümanlar.",
	"edge.env.description": "Ortam anahtar/değer eşleri için isteğe bağlı sözlük.",
	"edge.cwd.description": "Çalışma zamanı yürütülebilir dosyası için isteğe bağlı çalışma dizini.",
	"edge.sourceMaps.description": "JavaScript kaynak haritaları kullanın (varsa).",
	"edge.diagnosticLogging.description": "Doğru olduğunda, bağdaştırıcı kendi tanılama bilgilerini herkesin okuyabileceği biçimde konsola yazdırır",
	"edge.verboseDiagnosticLogging.description": "Doğru olduğunda, bağdaştırıcı istemci ve hedef ('diagnosticLogging' tarafından kaydedilen bilgileri de) ile tüm trafiğini günlüğe kaydeder",
	"edge.trace.description": "'true' olduğunda; hata ayıklayıcı, izleme bilgisini bir dosyaya günlük şeklinde kaydeder. 'verbose' olduğunda, günlükleri ayrıca konsolda gösterir.",
	"edge.sourceMapPathOverrides.description": "Kaynak dosyalarının konumlarını, kaynak haritanın belirttiği yerden disk üzerindeki konumlarına yeniden yazmak için bir eşlemeler dizisi. Ayrıntılar için README dosyasına bakın.",
	"edge.skipFiles.description": "Hata ayıklama yapılırken atlanacak dosya veya klasör adları, veya yol glob desenleri dizisi.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "breakOnLoad için kullanılacak strateji.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Kesme noktasının ayarlandığı dosya ile aynı ada sahip dosyalarda kesme noktalarını iyimser olarak ayarlar."
}