/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Depurar seu código JavaScript no navegador Microsoft Edge",
	"edge.toggleSkipping.title": "Alternar Inorar Este Arquivo",
	"edge.port.description": "Porta a ser usada para depuração remota do Microsoft Edge",
	"edge.address.description": "Endereço TCP/IP da porta de depuração",
	"edge.file.description": "Um arquivo HTML local para abrir no navegador",
	"edge.url.description": "Busca uma guia com esta url EXATA e anexa à ele, se for encontrada",
	"edge.webRoot.description": "Especifica o caminho absoluto do espaço de trabalho para a raiz do servidor Web. Usado para resolver caminhos como '/app.js' para arquivos em disco. Atalho para um mapeamento em \"/\"",
	"edge.pathMapping.description": "Um mapeamento de URLs/caminhos para pastas locais, para resolver scripts no Edge para scripts em disco",
	"edge.runtimeExecutable.description": "Caminho absoluto do espaço de trabalho para o executável de tempo de execução a ser usado. Se não for especificado, o edge será usado a partir do local de instalação padrão.",
	"edge.runtimeArgs.description": "Argumentos opcionais passados ao executável runtime.",
	"edge.env.description": "Dicionário opcional de pares chave/valor de ambiente.",
	"edge.cwd.description": "Diretório de trabalho opcional para o executável do runtime.",
	"edge.sourceMaps.description": "Use mapeamento de fonte JavaScript (se existir).",
	"edge.diagnosticLogging.description": "Quando true, o adaptador registra no console suas próprias informações de diagnóstico em um formato legível para humanos",
	"edge.verboseDiagnosticLogging.description": "Quando verdadeiro, o adaptador registra todo o tráfego com o cliente e o destino (assim como a informação registrada por 'diagnosticLogging')",
	"edge.trace.description": "Quando 'verdadeiro', o depurador registrará informações de rastreamento em um arquivo. Quando 'detalhado', também mostrará os logs no console.",
	"edge.sourceMapPathOverrides.description": "Um conjunto de mapeamentos para reescrever as localizações dos arquivos fontes de onde o sourcemap aponta para os seus locais no disco. Veja o README para detalhes.",
	"edge.skipFiles.description": "Uma matriz de nomes de arquivos ou pastas, ou globs de caminho, para ignorar quando estiver depurando.",
	"edge.timeout.description": "Tente novamente por este número de milissegundos para se conectar ao Edge. O padrão é 10000 ms.",
	"edge.breakOnLoadStrategy.description": "A estratégia a ser usada para breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Desativa o breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Define pontos de parada otimisticamente nos arquivos com o mesmo nome do arquivo no qual o ponto de parada é configurado."
}