/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Microsoft Edge tarayıcısında JavaScript kodunuzun hatalarını ayıklayın",
	"edge.toggleSkipping.title": "Bu Dosyayı Atlamayı Aç/Kapa",
	"edge.port.description": "Microsoft Edge uzaktan hata ayıklama için kullanılacak port.",
	"edge.address.description": "Hata ayıklama portunun TCP/IP adresi",
	"edge.file.description": "Tarayıcıda açılacak yerel bir html dosyası",
	"edge.url.description": "Bu url'in TAMAMEN AYNISININ bulunduğu bir sayfa arayacak ve bulunduysa ona bağlayacaktır.",
	"edge.webRoot.description": "Bu, web sunucusu kök dizini için çalışma alanı mutlak yolunu belirtir. `/app.js` gibi yolların diskteki dosyalara çözümlenmesinde kullanılır. \"/\" için bir 'pathMapping' kısaltmasıdır",
	"edge.pathMapping.description": "Edge'deki betikleri, diskteki betiklere çözümleyecek bir URL'ler/yerel klasör yolları eşlemesi",
	"edge.runtimeExecutable.description": "Kullanılacak çalışma zamanı yürütülebilir dosyası için çalışma alanı mutlak yolu. Belirtilmezse, Edge varsayılan yükleme konumundan kullanılacaktır.",
	"edge.runtimeArgs.description": "Çalışma zamanı yürütülebilir dosyasına iletilecek isteğe bağlı argümanlar.",
	"edge.env.description": "Ortam anahtar/değer eşleri için isteğe bağlı sözlük.",
	"edge.cwd.description": "Çalışma zamanı yürütülebilir dosyası için isteğe bağlı çalışma dizini.",
	"edge.sourceMaps.description": "JavaScript kaynak haritaları kullanın (varsa).",
	"edge.diagnosticLogging.description": "Doğru olduğunda, bağdaştırıcı kendi tanılama bilgilerini herkesin okuyabileceği biçimde konsola yazdırır",
	"edge.verboseDiagnosticLogging.description": "Doğru olduğunda, bağdaştırıcı istemci ve hedef ('diagnosticLogging' tarafından kaydedilen bilgileri de) ile tüm trafiğini günlüğe kaydeder",
	"edge.trace.description": "'true' olduğunda; hata ayıklayıcı, izleme bilgisini bir dosyaya günlük şeklinde kaydeder. 'verbose' olduğunda, günlükleri ayrıca konsolda gösterir.",
	"edge.sourceMapPathOverrides.description": "Kaynak dosyalarının konumlarını, kaynak haritanın belirttiği yerden disk üzerindeki konumlarına yeniden yazmak için bir eşlemeler dizisi. Ayrıntılar için README dosyasına bakın.",
	"edge.skipFiles.description": "Hata ayıklama yapılırken atlanacak dosya veya klasör adları, veya yol glob desenleri dizisi.",
	"edge.timeout.description": "Edge'e yeniden bağlanmak için bu sayıda milisaniye kadar tekrar deneyin. Varsayılan 10000 ms'dir.",
	"edge.breakOnLoadStrategy.description": "breakOnLoad için kullanılacak strateji.",
	"edge.breakOnLoadStrategy.off.description": "breakOnLoad'u devre dışı bırakır.",
	"edge.breakOnLoadStrategy.regex.description": "Kesme noktasının ayarlandığı dosya ile aynı ada sahip dosyalarda kesme noktalarını iyimser olarak ayarlar."
}