{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Überspringen dieser Datei umschalten",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "TCP/IP Adresse des Debugports",
	"edge.file.description": "Eine lokale html-Datei im Browser zu öffnen",
	"edge.url.description": "Es wird eine Registerkarte mit exakt dieser URL gesucht und daran angefügt, falls gefunden",
	"edge.webRoot.description": "Dies gibt den absoluten Arbeitsbereichspfad zum Webserverstamm an. Wird zum Auflösen von Pfaden wie \"/apps.js\" für Dateien auf einem Datenträger verwendet. Kurz für ein pathMapping für \"/\".",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Optionale Argumente, die an die ausführbare Laufzeitdatei übergeben werden.",
	"edge.env.description": "Optionales Wörterbuch von Umgebungs- Schlüssel-Wert-Paaren.",
	"edge.cwd.description": "Optionales Arbeitsverzeichnis für die ausführbare Laufzeitdatei.",
	"edge.sourceMaps.description": "Verwendet JavaScript-Quellzuordnungen (wenn vorhanden).",
	"edge.diagnosticLogging.description": "Bei \"true\" protokolliert der Adapter seine eigenen Diagnoseinformationen in einem für Menschen lesbares Format an die Konsole.",
	"edge.verboseDiagnosticLogging.description": "Bei \"true\" protokolliert der Adapter den gesamten Datenverkehr mit dem Client und Ziel (sowie die von \"diagnosticLogging\" protokollierten Informationen).",
	"edge.trace.description": "Bei \"true\" protokolliert der Adapter Ablaufverfolgungsinformationen in einer Datei. Bei der Einstellung \"verbose\" werden außerdem Protokolle in der Konsole angezeigt.",
	"edge.sourceMapPathOverrides.description": "Eine Gruppe von Mappings, mit denen die in der Sourcemap angegebenen Pfade der Quelldateien in ihre Pfade auf dem Datenträger umgeschrieben werden. Ausführliche Informationen finden Sie in der Infodatei.",
	"edge.skipFiles.description": "Ein Feld von Datei- oder Ordnernamen oder glob Mustern , die beim Debuggen übersprungen werden sollen.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "Die Strategie für breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Breakpoints optimistisch in Dateien mit dem selben Namen setzen wie in der Datei, in der der Breakpoint gesetzt ist."
}