{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Alternar Inorar Este Arquivo",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "Endereço TCP/IP da porta de depuração",
	"edge.file.description": "Um arquivo HTML local para abrir no navegador",
	"edge.url.description": "Busca uma guia com esta url EXATA e anexa à ele, se for encontrada",
	"edge.webRoot.description": "Especifica o caminho absoluto do espaço de trabalho para a raiz do servidor Web. Usado para resolver caminhos como '/app.js' para arquivos em disco. Atalho para um mapeamento em \"/\"",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Argumentos opcionais passados ao executável runtime.",
	"edge.env.description": "Dicionário opcional de pares chave/valor de ambiente.",
	"edge.cwd.description": "Diretório de trabalho opcional para o executável do runtime.",
	"edge.sourceMaps.description": "Use mapeamento de fonte JavaScript (se existir).",
	"edge.diagnosticLogging.description": "Quando true, o adaptador registra no console suas próprias informações de diagnóstico em um formato legível para humanos",
	"edge.verboseDiagnosticLogging.description": "Quando verdadeiro, o adaptador registra todo o tráfego com o cliente e o destino (assim como a informação registrada por 'diagnosticLogging')",
	"edge.trace.description": "Quando 'verdadeiro', o depurador registrará informações de rastreamento em um arquivo. Quando 'detalhado', também mostrará os logs no console.",
	"edge.sourceMapPathOverrides.description": "Um conjunto de mapeamentos para reescrever as localizações dos arquivos fontes de onde o sourcemap aponta para os seus locais no disco. Veja o README para detalhes.",
	"edge.skipFiles.description": "Uma matriz de nomes de arquivos ou pastas, ou globs de caminho, para ignorar quando estiver depurando.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "A estratégia a ser usada para breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Define pontos de parada otimisticamente nos arquivos com o mesmo nome do arquivo no qual o ponto de parada é configurado."
}