{
	"extension.description": "Debug your JavaScript code in the Microsoft Edge browser",
	"edge.toggleSkipping.title": "Attiva/disattiva \"Ignora questo file\"",
	"edge.port.description": "Port to use for Microsoft Edge remote debugging.",
	"edge.address.description": "TCP/IP address of debug port",
	"edge.file.description": "A local html file to open in the browser",
	"edge.url.description": "Cerca una scheda con l'esatto url e la allega ad esso, se trovato",
	"edge.webRoot.description": "Specifica il percorso assoluto dell'area di lavoro nella root del webserver. Utilizzato per risolvere i percorsi come `/app.js` al file su disco. Forma abbreviata di un pathMapping per \"/\"",
	"edge.pathMapping.description": "A mapping of URLs/paths to local folders, to resolve scripts in edge to scripts on disk",
	"edge.runtimeExecutable.description": "Workspace absolute path to the runtime executable to be used. If not specified, edge will be used from the default install location.",
	"edge.runtimeArgs.description": "Argomenti facoltativi passati all'eseguibile del runtime.",
	"edge.env.description": "Optional dictionary of environment key/value pairs.",
	"edge.cwd.description": "Directory di lavoro facoltativa per l'eseguibile di runtime.",
	"edge.sourceMaps.description": "Usa i mapping di origine JavaScript (se esistenti).",
	"edge.diagnosticLogging.description": "Se impostato a true, l'adapter registra le proprie informazioni di diagnostica sulla console in un formato leggibile",
	"edge.verboseDiagnosticLogging.description": "Quando è true, l'adapter registra tutto il traffico con il client e con il target (oltre alle informazioni registrate dal 'diagnosticLogging')",
	"edge.trace.description": "Se 'true', il debugger registrerà informazioni di trace in un file. Se 'verbose', mostrerà anche i log nella console.",
	"edge.sourceMapPathOverrides.description": "Un insieme di mapping per riscrivere i percorsi dei file sorgenti dalla locazione indicata nel sourcemap alla loro posizione sul disco. Per dettagli, vedere il file README.",
	"edge.skipFiles.description": "Una matrice di nomi di file, nomi di cartelle, o modelli di glob, da ignorare durante il debug.",
	"edge.timeout.description": "Retry for this number of milliseconds to connect to Edge. Default is 10000 ms.",
	"edge.breakOnLoadStrategy.description": "Strategia da utilizzare per breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Turns off breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Imposta i breakpoint ottimisticamente nei file con lo stesso nome dei file in cui i breakpoint sono già definiti."
}