/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Depure el código JavaScript en el explorador Microsoft Edge",
	"edge.toggleSkipping.title": "Cambiar y omitir este archivo",
	"edge.port.description": "Puerto que se va a usar para la depuración remota de Microsoft Edge.",
	"edge.address.description": "Dirección TCP/IP del puerto de depuración.",
	"edge.file.description": "Archivo HTML local para abrirlo en el explorador.",
	"edge.url.description": "Busca una pestaña con esta dirección URL EXACTA y, si la encuentra, se asocia a ella.",
	"edge.webRoot.description": "Especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor web. Se usa para resolver rutas de acceso como \"/app.js\" en archivos del disco. Forma abreviada para una asignación de ruta de acceso para \"/\"",
	"edge.pathMapping.description": "Asignación de direcciones URL o rutas de acceso a carpetas locales, para resolver los scripts de Edge en scripts en el disco.",
	"edge.runtimeExecutable.description": "Ruta de acceso absoluta del área de trabajo al ejecutable del entorno de ejecución que se va a usar. Si no se especifica, se usará Edge desde la ubicación de instalación predeterminada.",
	"edge.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
	"edge.env.description": "Diccionario opcional de pares clave-valor del entorno.",
	"edge.cwd.description": "Directorio de trabajo opcional para el ejecutable del entorno de ejecución.",
	"edge.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
	"edge.diagnosticLogging.description": "Si es true, el adaptador registra su propia información de diagnóstico en la consola en lenguaje natural.",
	"edge.verboseDiagnosticLogging.description": "Si es true, el adaptador registra todo el tráfico en el cliente y el destino (así como la información que \"diagnosticLogging\" registra)",
	"edge.trace.description": "Si es \"true\", el depurador registrará información de seguimiento en un archivo. Si es \"verbose\", también mostrará los registros en la consola.",
	"edge.sourceMapPathOverrides.description": "Conjunto de asignaciones para reescribir las ubicaciones de los archivos de origen en sus ubicaciones en el disco, a partir de lo que indica el mapa de origen. Consulte el archivo LÉAME para obtener más detalles.",
	"edge.skipFiles.description": "Matriz de nombres de archivo o carpeta, o de patrones globales de ruta de acceso, que se van a omitir en la depuración.",
	"edge.timeout.description": "Vuelva a probar con este número de milisegundos para conectarse a Edge. El valor predeterminado es 10000 ms.",
	"edge.breakOnLoadStrategy.description": "La estrategia que se va a usar para breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Desactiva breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Establece puntos de interrupción de forma optimista en los archivos con el mismo nombre que el archivo en el que está establecido el punto de interrupción.",
	"edge.logTimestamps.description": "Valor booleano para activar o desactivar el registro de marcas de tiempo en los archivos de registro (activado de forma predeterminada)."
}