/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"edge.toggleSkipping.title": "Alternar la omisión de este archivo",
	"edge.address.description": "Dirección TCP/IP del puerto de depuración",
	"edge.file.description": "Un archivo html local para abrirlo en el navegador",
	"edge.url.description": "Busca una pestaña con esta url EXACTA y se adjunta a ella, si se encuentra",
	"edge.webRoot.description": "Esto especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor Web. Utilizado para resolver rutas de acceso como `/app.js` a archivos en disco. Abreviatura de asignación de ruta de acceso para \"/\"",
	"edge.pathMapping.description": "Mapeo de URLs o rutas a carpetas locales, con objeto de resolver scripts en Edge a scripts en disco",
	"edge.runtimeExecutable.description": "Se usará la ruta absoluta al espacio de trabajo. Si no está especificada, edge será lanzado desde la ubicación de instalación por defecto.",
	"edge.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
	"edge.env.description": "Diccionario opcional de pares clave/valor del ambiente.",
	"edge.cwd.description": "Directorio de trabajo opcional para el ejecutable ",
	"edge.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
	"edge.diagnosticLogging.description": "Cuando es verdadero, el adaptador registra su propia información de diagnóstico a la consola en un formato legible para los humanos",
	"edge.verboseDiagnosticLogging.description": "Cuando es verdadero, el adaptador registra todo el tráfico con el cliente y el objetivo (así como también la información registrada por 'diagnosticLogging')",
	"edge.trace.description": "Cuando es 'true', el depurador registrará la información de seguimiento en un fichero. Cuando es 'verbose', también mostrará registros en la consola.",
	"edge.sourceMapPathOverrides.description": "Un conjunto de mapeos para reescribir las localizaciones de los ficheros fuente con lo que los mapas fuente indican, a sus ubicaciones en disco. Ver README para más detalles ",
	"edge.skipFiles.description": "Una matriz de nombres de archivo o carpeta, o patrones de ruta, que se deben omitir en la depuración.",
	"edge.timeout.description": "Reintentar la conección a Edge durante esta cantidad de milisegundos. El valor por defecto es 10000 ms.",
	"edge.breakOnLoadStrategy.description": "La estrategia de utilizar para breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Desactiva breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Establece los puntos de interrupción de forma optimista en archivos con el mismo nombre que el archivo en el que se establece el punto de interrupción."
}