/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Déboguer votre code JavaScript dans le navigateur Microsoft Edge",
	"edge.toggleSkipping.title": "Activer/désactiver l'évitement de ce fichier",
	"edge.port.description": "Port à utiliser pour le débogage à distance de Microsoft Edge.",
	"edge.address.description": "Adresse TCP/IP du port de débogage",
	"edge.file.description": "Un fichier html local à ouvrir dans le navigateur",
	"edge.url.description": "Recherchera un onglet avec cette url exacte et l'attachera, s'il est trouvé",
	"edge.webRoot.description": "Ceci spécifie le chemin absolu de l’espace de travail à la racine du serveur Web. Utilisé pour résoudre des chemins d’accès comme '/app.js' à des fichiers sur le disque. Raccourci pour un pathMapping pour \"/\"",
	"edge.pathMapping.description": "Un mappage d’URL/chemins d’accès aux dossiers locaux, pour résoudre les scripts dans Edge vers les scripts sur le disque",
	"edge.runtimeExecutable.description": "Chemin d’accès absolu de l'espace de travail vers le runtime exécutable à utiliser. Si non spécifié, Edge utilisera l’emplacement d’installation par défaut.",
	"edge.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
	"edge.env.description": "Dictionnaire optionnel de paires clé/valeur d’environnement.",
	"edge.cwd.description": "Répertoire de travail optionnel pour le runtime exécutable.",
	"edge.sourceMaps.description": "Utilisez des mappages de sources JavaScript (s'ils existent)",
	"edge.diagnosticLogging.description": "Si vrai, l’adaptateur journalise sa propre information sur le diagnostic vers la console dans un format lisible par l’homme",
	"edge.verboseDiagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise tout le trafic avec le client et la cible (ainsi que les informations journalisées par 'diagnosticLogging')",
	"edge.trace.description": "Quand la valeur est 'true', le débogueur journalise les informations de suivi dans un fichier. Quand la valeur est 'verbose', il affiche également les journaux dans la console.",
	"edge.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des informations du mappage de source vers leurs emplacements sur le disque. Consultez le fichier README pour plus de détails.",
	"edge.skipFiles.description": "Un tableau de noms de fichier ou de dossier, ou de chemin d’accès globs, à ignorer lors du débogage.",
	"edge.timeout.description": "Réessayez de vous connecter à Edge pendant le nombre de millisecondes spécifié. La valeur par défaut est 10000 ms.",
	"edge.breakOnLoadStrategy.description": "La stratégie à utiliser pour breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Désactiver breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Affecte les points d'arrêts de manière optimiste dans les fichiers avec le même nom que le fichier dans lequel le point d'arrêt est affecté."
}