/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Déboguer votre code JavaScript dans le navigateur Microsoft Edge",
	"edge.toggleSkipping.title": "Ignorer/Ne pas ignorer ce fichier",
	"edge.port.description": "Port à utiliser pour le débogage à distance Microsoft Edge.",
	"edge.address.description": "Adresse TCP/IP du port de débogage",
	"edge.file.description": "Fichier html local à ouvrir dans le navigateur",
	"edge.url.description": "Cherche un onglet avec cette URL EXACTE et l'attache, le cas échéant",
	"edge.webRoot.description": "Ceci spécifie le chemin absolu de l'espace de travail à la racine du serveur web. Permet de résoudre les chemins tels que '/app.js' en fichiers sur disque. Raccourci d'un pathMapping pour \"/\"",
	"edge.pathMapping.description": "Mappage des URL/chemins aux dossiers locaux, pour résoudre les scripts dans Edge en scripts sur disque",
	"edge.runtimeExecutable.description": "Chemin absolu de l'espace de travail de l'exécutable du runtime à utiliser. S'il n'est pas spécifié, Edge est utilisé à partir de l'emplacement d'installation par défaut.",
	"edge.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
	"edge.env.description": "Dictionnaire facultatif des paires clé/valeur de l'environnement.",
	"edge.cwd.description": "Répertoire de travail facultatif pour l'exécutable du runtime.",
	"edge.sourceMaps.description": "Utilisez des mappages de sources JavaScript (le cas échéant).",
	"edge.diagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise ses propres informations de diagnostic dans la console dans un format compréhensible",
	"edge.verboseDiagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise l'ensemble du trafic lié au client et à la cible (ainsi que les informations journalisées par 'diagnosticLogging')",
	"edge.trace.description": "Quand la valeur est 'true', le débogueur journalise les informations de traçage dans un fichier. Quand la valeur est 'verbose', il affiche également les journaux dans la console.",
	"edge.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des indications du mappage de source vers les emplacements appropriés sur le disque. Pour plus d'informations, consultez le README.",
	"edge.skipFiles.description": "Groupe de noms de fichiers ou de dossiers, ou globs de chemin, à ignorer durant le débogage.",
	"edge.timeout.description": "Réessayez de vous connecter à Edge pendant le nombre suivant de millisecondes. Valeur par défaut : 10 000 ms.",
	"edge.breakOnLoadStrategy.description": "Stratégie à utiliser pour breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Désactive breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Définit les points d'arrêt de manière optimiste dans les fichiers qui portent le même nom que le fichier dans lequel le point d'arrêt est défini.",
	"edge.logTimestamps.description": "Valeur booléenne permettant d'activer/de désactiver la journalisation des horodatages dans les fichiers journaux (activée par défaut)."
}