/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Déboguer votre code JavaScript dans le navigateur Microsoft Edge",
	"edge.toggleSkipping.title": "Microsoft Edge : Ignorer/Ne pas ignorer ce fichier",
	"edge.toggleSmartStep.title": "Microsoft Edge : Exécuter/Ne pas exécuter un pas à pas intelligent",
	"edge.port.description": "Port à utiliser pour le débogage à distance Microsoft Edge.",
	"edge.address.description": "Adresse TCP/IP du port de débogage",
	"edge.file.description": "Fichier html local à ouvrir dans le navigateur",
	"edge.url.description": "Cherche un onglet avec cette URL EXACTE et l'attache, le cas échéant",
	"edge.webRoot.description": "Ceci spécifie le chemin absolu de l'espace de travail à la racine du serveur web. Permet de résoudre les chemins tels que '/app.js' en fichiers sur disque. Raccourci d'un pathMapping pour \"/\"",
	"edge.pathMapping.description": "Mappage des URL/chemins aux dossiers locaux, pour résoudre les scripts dans Microsoft Edge en scripts sur disque",
	"edge.runtimeExecutable.description": "Chemin absolu de l'espace de travail de l'exécutable du runtime à utiliser. S'il n'est pas spécifié, Edge est utilisé à partir de l'emplacement d'installation par défaut.",
	"edge.runtimeArgs.description": "Arguments facultatifs passés à l'exécutable du runtime.",
	"edge.env.description": "Dictionnaire facultatif des paires clé/valeur de l'environnement.",
	"edge.cwd.description": "Répertoire de travail facultatif pour l'exécutable du runtime.",
	"edge.sourceMaps.description": "Utilisez des mappages de sources JavaScript (le cas échéant).",
	"edge.diagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise ses propres informations de diagnostic dans la console dans un format compréhensible",
	"edge.verboseDiagnosticLogging.description": "Quand la valeur est true, l'adaptateur journalise l'ensemble du trafic lié au client et à la cible (ainsi que les informations journalisées par 'diagnosticLogging')",
	"edge.trace.description": "Quand la valeur est 'true', le débogueur journalise les informations de traçage dans un fichier. Quand la valeur est 'verbose', il affiche également les journaux dans la console.",
	"edge.sourceMapPathOverrides.description": "Ensemble de mappages pour la réécriture des emplacements des fichiers sources à partir des indications du mappage de source vers les emplacements appropriés sur le disque. Pour plus d'informations, consultez le README.",
	"edge.smartStep.description": "Exécutez un pas à pas automatique parmi les lignes non mappées des fichiers de mappage de source. Il peut s'agir, par exemple, du code produit automatiquement par TypeScript durant la compilation d'async/await ou d'autres fonctionnalités.",
	"edge.skipFiles.description": "Groupe de noms de fichiers ou de dossiers, ou globs de chemin, à ignorer durant le débogage.",
	"edge.timeout.description": "Réessayez de vous connecter à Microsoft Edge pendant le nombre suivant de millisecondes. Valeur par défaut : 10 000 ms.",
	"edge.disableNetworkCache.description": "Contrôle si le cache réseau de chaque requête doit être ignoré",
	"edge.urlFilter.description": "Cherche une page avec cette URL et l'attache, le cas échéant. Les caractères génériques * sont autorisés.",
	"edge.showAsyncStacks.description": "Afficher les appels asynchrones ayant conduit à la pile des appels actuelle",
	"edge.logTimestamps.description": "Valeur booléenne permettant d'activer/de désactiver la journalisation des horodatages dans les fichiers journaux (activée par défaut).",
	"edge.version.description": "Indique à l'adaptateur d'utiliser le navigateur Microsoft Edge (Chromium). Omettez cet indicateur si vous souhaitez lancer Microsoft Edge (EdgeHTML).",
	"edge.userDataDir.description": "Par défaut, Microsoft Edge est lancé avec un profil utilisateur distinct dans un dossier temporaire. Utilisez cette option pour le remplacer. Affectez la valeur false pour démarrer avec votre profil utilisateur par défaut. Notez que cela s'applique uniquement à Microsoft Edge (Chromium) et non à Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoad.description": "Fonctionnalité expérimentale - Si la valeur est true, l'adaptateur de débogage tente de définir des points d'arrêt dans les scripts avant leur chargement. Ainsi, il peut atteindre les points d'arrêt au début de ces scripts. Cela a un impact sur le niveau de performance. Notez que cela s'applique uniquement à Microsoft Edge (Chromium) et non à Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.description": "Stratégie à utiliser pour breakOnLoad. Notez que cela s'applique uniquement à Microsoft Edge (Chromium) et non à Microsoft Edge (EdgeHTML).",
	"edge.breakOnLoadStrategy.instrument.description": "Indiquer à Microsoft Edge d'interrompre son exécution durant le chargement de chaque script pour résoudre les mappages de sources et définir les points d'arrêt",
	"edge.breakOnLoadStrategy.regex.description": "Définit les points d'arrêt de manière optimiste dans les fichiers qui portent le même nom que le fichier dans lequel le point d'arrêt est défini.",
	"edge.breakOnLoadStrategy.off.description": "Désactive breakOnLoad.",
	"edge.targetTypes.description": "Tableau de types cibles acceptables. Valeur par défaut : '[\"page\"]'."
}