/*---------------------------------------------------------------------------------------------
 *  Copyright (c) Microsoft Corporation. All rights reserved.
 *  Licensed under the MIT License. See License.txt in the project root for license information.
 *--------------------------------------------------------------------------------------------*/
// Do not edit this file. It is machine generated.
{
	"extension.description": "Depurar o código JavaScript no navegador Microsoft Edge",
	"edge.toggleSkipping.title": "Ativar/desativar a Opção de Ignorar Este Arquivo",
	"edge.port.description": "Porta a ser usada para a depuração remota do Microsoft Edge.",
	"edge.address.description": "O endereço TCP/IP da porta de depuração",
	"edge.file.description": "Um arquivo html local a ser aberto no navegador",
	"edge.url.description": "Será pesquisada uma guia com essa URL EXATA para anexar a ela, se encontrada",
	"edge.webRoot.description": "Especifica o caminho absoluto do workspace para a raiz do servidor Web. Usado para resolver caminhos, como '/app.js', para arquivos no disco. A abreviação de um pathMapping como \"/\"",
	"edge.pathMapping.description": "Um mapeamento de URLs/caminhos para as pastas locais, para resolver scripts no Edge para scripts no disco",
	"edge.runtimeExecutable.description": "O caminho absoluto do workspace para o executável do tempo de execução a ser usado. Se não for especificado, o Edge será usado no local de instalação padrão.",
	"edge.runtimeArgs.description": "Argumentos opcionais passados para o executável de tempo de execução.",
	"edge.env.description": "Dicionário opcional de pares chave-valor do ambiente.",
	"edge.cwd.description": "Diretório de trabalho opcional para o executável do tempo de execução.",
	"edge.sourceMaps.description": "Usar os mapas de origem JavaScript (caso haja algum).",
	"edge.diagnosticLogging.description": "Quando for true, o adaptador registrará suas próprias informações de diagnóstico no console em um formato legível por pessoas",
	"edge.verboseDiagnosticLogging.description": "Quando for true, o adaptador registrará todo o tráfego no cliente e no destino (assim como as informações registradas pelo 'diagnosticLogging')",
	"edge.trace.description": "Quando for 'true', o depurador registrará as informações de acompanhamento em um arquivo. Quando for 'verbose', ele também mostrará os logs no console.",
	"edge.sourceMapPathOverrides.description": "Um conjunto de mapeamentos para regravar os locais dos arquivos de origem indicados pelo sourcemap, para seus respectivos locais no disco. Confira o LEIAME para obter detalhes.",
	"edge.skipFiles.description": "Uma matriz de nomes de arquivos ou de pastas ou globs de caminho a serem ignorados durante a depuração.",
	"edge.timeout.description": "Repetir a conexão com o Edge após esse número de milissegundos. O padrão é 10000 ms.",
	"edge.breakOnLoadStrategy.description": "A estratégia a ser usada para breakOnLoad.",
	"edge.breakOnLoadStrategy.off.description": "Ativa o breakOnLoad.",
	"edge.breakOnLoadStrategy.regex.description": "Define os pontos de interrupção de modo otimista em arquivos com o mesmo nome que o arquivo no qual o ponto de interrupção está definido.",
	"edge.logTimestamps.description": "Valor booliano para ativar/desativar o registro de carimbos de data/hora nos arquivos de log (ativado por padrão)."
}